{
  "id": "episode-5",
  "season": 1,
  "number": 5,
  "title": "Perspective-Driven Positioning",
  "status": "To be released",
  "guestId": "alex-james",
  "guest": {
    "name": "Alex James",
    "image": "assets/images/guest-pictures/AlexJ.png",
    "linkedin": "https://www.linkedin.com/in/alexjamesmessaging/",
    "website": "https://alexjamesmessaging.com/"
  },
  "description": "Alex and I had to do this twice. The first time, the gods of inter-continental communications were not on our side. It was so worth it to double down on it. Wrath of Gods be damned.\n\n**Topics:**\n- What does it mean to have a \"Perspective-Driven\" positioning approach?\n- How do you develop a perspective that's both unique and useful?\n- What are the practical steps to implement perspective-driven positioning?\n\n[Alex James](https://www.linkedin.com/in/alexjamesmessaging/) is a Messaging Strategist for B2B firms and a friend. Like so many, I was struck by his impeccable carousels on LinkedIn. Seeing that being their brilliance there must be a really clever and creative mind, I got in touch. From there, some of the freshest conversations I've had for a while. Bringing Alex on was a no-brainer.",
  "links": [
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/in/alexjamesmessaging/"
    },
    {
      "text": "Website",
      "url": "https://alexjamesmessaging.com/"
    },
    {
      "text": "Newsletter",
      "url": "https://alexjamesmessaging.com/newsletter/"
    }
  ],
  "shortTopics": [
    "Perspective-Driven Approach",
    "Unique & Useful Views",
    "Implementation Steps"
  ],
  "episodeLink": null,
  "spotifyUrl": null,
  "transcript": "<p class=\"text-body\"><span class=\"transcript-meta\">[00:13] João:</span><br>Okay, so hello everyone. Welcome to Exotic Matter, which is my podcast series where I interview some internet friends about the future of agency and consulting work or more generally, knowledge work and how that has been changing the whole AI global competition, clients taking work in-house and all of this never before seen level of difficulty on doing this kind of work. So with me, I have Alex James from Minimalistic Marketing, and Alex is a messaging strategist. Hi, Alex.</p><p class=\"text-body\"><span class=\"transcript-meta\">[00:43] Alex James:</span><br>Thanks for having me.</p><p class=\"text-body\"><span class=\"transcript-meta\">[00:45] João:</span><br>It's a pleasure. really is. Especially because people don't know how much work it was for us to get into this. So I'm happy to be doing it. But so Alex, I think we met through Patrick Kizny. Patrick at the time sent me like a DM or something and with your LinkedIn page, was like, you need to check him out. And I think it took me a little bit. And then I eventually got to that message and I was really blown away by, I always describe your work in this way by the wit and the taste. It was really clever, really cool. And I started to nerd out on your stuff and eventually we got to chat and it's been really interesting to discuss these things with you.</p><p class=\"text-body\"><span class=\"transcript-meta\">[01:22] Alex James:</span><br>Yeah, mean, I'm really, thank you Patrick for teeing us up. Yeah, yeah, yeah, yeah. I'm really loving the work that you're doing and all the content that you're putting out. I think that we see the world in similar ways and it's good to have like a kindred spirit in Brazil...</p><p class=\"text-body\"><span class=\"transcript-meta\">[01:26] João:</span><br>Hahaha ...Yeah, it's just keeping it below the equator line. It's always a good move. No, not dissing the other guys, sorry. But so one of the things that I think stands out from the work is when we started to talk about this podcast, you've actually challenged me in the way I was planning this podcast because I was thinking to...</p><p class=\"text-body\"><span class=\"transcript-meta\">[01:45] Alex James:</span><br>Yeah, I think so.</p><p class=\"text-body\"><span class=\"transcript-meta\">[02:00] João:</span><br>...take it more towards just workshop magic kind of things because you also have your own workshop and workshop-like sessions. And you're like, I don't think that's really the insight we should be exploring now. And you've teased me into going for a different perspective. Could you synthesize that?</p><p class=\"text-body\"><span class=\"transcript-meta\">[02:17] Alex James:</span><br>Yeah, I mean, I think the tendency that subject matter experts tend to lean towards is really getting obsessed over the craft because, we're thinking about it and nerding out about it all the time and we're fascinated by it. But in order to get people to see and appreciate the craft at the same level that we do, we need to enroll them in the context first, context before craft. And so I believe what I suggested to you was to kind of elevate the conversation above like, hey, here is how to structure a really good workshop and here's why workshops are great. And more towards, well, why are workshops... ...so important now at this point in history. What's happening at the category level that's really driving the need for people to stop working for their clients and start working with them. And I think that's what you really kind of took on board and it's what informed like the theme of this podcast, which I'm happy for. I'm happy that I was able to trick you into my ideology.</p><p class=\"text-body\"><span class=\"transcript-meta\">[03:17] João:</span><br>Yeah, not happier than I am. But I think there's like a connection from that point to another thing that you've mentioned usually, which is like your perspective is your product. And you've also had this take around niching that is not enough. Can you?</p><p class=\"text-body\"><span class=\"transcript-meta\">[03:30] Alex James:</span><br>Yeah, well, let's, let's actually, I'll jump back in time to like, when I thank you for that, when I kind of first started marketing about 12 years ago. So essentially, like what I do with clients is really help them answer the, the big ultimate question when it comes to marketing professional services, because I'm a messaging strategist for B2B professional services. Specifically, I work with marketing agencies, research firms... software development houses And the question that they are constantly grappling with is how do we make people see that we are different and better before they've worked with us? It's often really easy to get people to see your value after they've already paid you. But then how are you gonna initiate that conversation? How are you going to actually get people topay your first invoice before they've experienced you. And this is where a lot of people really struggle. And so what they end up doing is treating their value proposition more like a marriage proposition. It's like, hey, sign up with us, let's become a partner and then you'll see how great we are. Doesn't work like that in the real world, unfortunately. I think every professional engagement is a series of escalating commitments. Every relationship is a series of escalating commitments. And so we need to respect that, that that's how human minds work and we need to swim with the flow of the river, not against it. But I really kind of stumbled into this, know, how do we make people see that we're different and better before they've worked with us? So I stumbled into it very early in my career. My first job in marketing was at a travel company. And I, to be honest, I thought that I was some kind of like marketing genius wizard prodigy because everything I put out there performed pretty well. And looking back now, it's like, oh, okay, yeah, I mean, I took a picture of a beach and then slapped some generic discount copy over the top of it. And hey, what do know, clicks and conversions and customers. It was my second job where I moved into a boutique business management consulting firm where I really understood that, oh, okay, everything that I thought I knew was completely wrong. I was, you know, running ads... SEO, cold emails, trade show boot, like nothing was working. And it made me really appreciate that, okay, in the B2B professional services space, it's not about just putting an offer in front of them necessarily. It's about building trust and authority over the long term to the point where the prospect is ready to reach out to the firm, not when the firm is ready to put out some kind of sale or something, it doesn't work that way.</p><p class=\"text-body\"><span class=\"transcript-meta\">[05:54] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[05:56] Alex James:</span><br>And it wasn't really until the job after that that I had my first breakthrough, but I can see now why all the stuff I was trying didn't work. It's very obvious to me now, but it's been a really fun, interesting challenge to grapple with for the last decade to figure out, okay, how do we do that? How do we build trust and authority in the long term and get people to... want to reach out to us or at least know that we are the option for them when they are ready to reach out. And that's what I've been grappling with. That's what I've been in the trenches with. And it's what I've learned a lot about. And yeah, I'm excited to share what I've learned today. To your question earlier though, around a niche is no longer enough. This is something I'm really radicalized about. It's something that I don't think people are talking about enough. It's something that is a genuine threat to professional service firms everywhere. We've basically been told to niche down, niche down, just niche down, niching down will solve all of your problems. It's the silver bullet. And more and more, I'm seeing that like that may have been true at one point, but it's no longer. To zoom back a bit more in time as well, to where the niche down strategy came from, it came from the internet, right? It came from you know, competition going from down the road to all across the globe. This actually was sped up by COVID as well, right? Like people became very comfortable with partners who worked completely remotely. You didn't have to fly around the world to work with somebody. You could just do it here. And like, I'm a perfect example of that. I'm in Australia. All of my clients are in the US or in Europe, basically. And so... What that is leading to is: A, the barriers for entry to start up a services firm is really, really low now. It's so cheap and easy. There are 53 % more marketing agencies in the US and Canada than there were five years ago. It went from about 29,000 to over 45,000 now. Clients are now demanding according to a data box survey that they want their partners to have at least industry specialization or skill specialization It's like 97 % there's like 3 % who don't care. Everybody else is like no that you need to be specialized in some way shape or form Right exactly and now there's like there's so much specialists are so available you can Google search like you can find them really easily now</p><p class=\"text-body\"><span class=\"transcript-meta\">[08:03] João:</span><br>Given the choice, why not,</p><p class=\"text-body\"><span class=\"transcript-meta\">[08:14] Alex James:</span><br>And this is why, according to Databox, it's conflicting numbers here. According to Databox, 90 % of agencies have now niched down in some way. According to Promethean research, 84 % of agencies have now niched down. Either way, it's the vast, vast, vast majority have niched down. it's because of that, because the niche down strategy has become so widely adopted, it's stopped. working its competitive edge has grown dull and firms everywhere I talked to them every day they say like they're feeling their differentiation dissolve and niche is no longer enough it's kind of like when I was in high school I was this is this is relevant when I was in high school I was I really struggled talking to girls like I couldn't I could hold the conversation with them I just didn't know how to start one which it turns out it's like yeah okay well</p><p class=\"text-body\"><span class=\"transcript-meta\">[08:58] João:</span><br>I have no idea what that is, never happened to me</p><p class=\"text-body\"><span class=\"transcript-meta\">[09:01] Alex James:</span><br>I know that you've been a cool cat since day one, since birth, but not all of us had that privilege. So like, just needed to figure out how to start a conversation. I tried the thing of like, existing nearby and hoping for the best doesn't quite work, unfortunately. But at the time, I was like really into like the strokes, especially I was like, these are the coolest guys in the world. I want to be them.</p><p class=\"text-body\"><span class=\"transcript-meta\">[09:04] João:</span><br>For real, yeah.And they were. So that was a good direction. Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[09:25] Alex James:</span><br>And they were, and they were, Right? And so what do they do? They play guitar. I'm going to learn guitar. Great. That'll be my unique selling point. That'll be my differentiator. I grew my hair long. I started wearing band t-shirts. I took lessons. I became a guitar guy. And you know what? It worked. It, it, my first high school girlfriend, it was because of the guitar. It was, it was a differentiator. It was a conversation starter. It was, it worked. But then I got to university. Suddenly I'm surrounded by literally thousands of dudes who looked and acted just like me. Like the, the, the girl to guitar ratio, was, it was catastrophic. You wouldn't believe.</p><p class=\"text-body\"><span class=\"transcript-meta\">[09:56] João:</span><br>Ah!</p><p class=\"text-body\"><span class=\"transcript-meta\">[10:06] Alex James:</span><br>And I went from like the guitar guy to a guitar guy. And like essentially like the value of my positioning went to zero. And so this is what I'm seeing in the professional services space. Like the value of your positioning is falling to zero and you need to have, you need to have a new differentiator that's more than just we do X service for Y industry. That is not enough anymore. And that's why like, just niching down, it's not a silver bullet, it will just at best get you a silver medal.</p><p class=\"text-body\"><span class=\"transcript-meta\">[10:36] João:</span><br>Yeah. And also it's very easy to get it wrong, right? The niching down thing. It's easy to think that you're actually niching down and you're not, or you're going so niche down that you're serving a market of none. it's...</p><p class=\"text-body\"><span class=\"transcript-meta\">[10:47] Alex James:</span><br>100%. Yeah, people can niche themselves out of business if they're not careful.</p><p class=\"text-body\"><span class=\"transcript-meta\">[10:52] João:</span><br>Yeah. So, and the missing ingredient is...</p><p class=\"text-body\"><span class=\"transcript-meta\">[10:56] Alex James:</span><br>The missing ingredient is a perspective. Because to your point, like people took the niche down thing so seriously that they, you know, they essentially niche themselves out of business. And really, like you don't want to be niching down to some crazy minute degree. You just want to be niching down enough. Like I'm not saying that you shouldn't niche down. I think that you should, but you should only do it to the level of what will give you a competitive edge. And what will give you a competitive edge is a perspective along with that niche. It's not just we do X for Y, it's we do X for Y because Zed. That Zed, that is your perspective. That is the reason that you do those things for that industry. Because I think like we need to acknowledge that we've now entered the thought leadership era. In 2019,</p><p class=\"text-body\"><span class=\"transcript-meta\">[11:31] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[11:44] Alex James:</span><br>58 % of companies, so according to Edelman research, 58 % of companies bought due to thought leadership content. In 2024, that number was 72%. Like that line has just gone up and to the right. And this is not just a blip. This is like a true transition moment. This is the new normal. And this is why like vibes and values and storytelling doesn't really cut it anymore because that's not differentiation, it's decoration and your prospects see that for what it is. And we need to remember that like, especially in B2B, we're not here to tell stories, we're not sitting around a campfire swapping tales, we're more like a lawyer in a courtroom making a case to a very skeptical jury. And so we don't need to be telling stories, we need to be building arguments. And that's what a perspective is, it's an argument for change, it is how are things typically done versus how things should be done. That is what people are buying into. It's actually less about the services that you sell and it's more about the change on the industry level that you seek to make. And my favorite example of this is Refine Labs. So Refine Labs, for anyone who doesn't know, is a B2B performance marketing agency for B2B SaaS...</p><p class=\"text-body\"><span class=\"transcript-meta\">[12:40] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[12:59] Alex James:</span><br>...companies, mid market and enterprise, extremely competitive sector, right? There's a lot of money in this space. So many players in this space. And yet in 2019, the founder and CEO Chris Walker, who had just been fired from like a marketing manager role, like a middle manager marketing role, started this agency with his laptop...</p><p class=\"text-body\"><span class=\"transcript-meta\">[13:05] João:</span><br>Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[13:21] Alex James:</span><br>... went from $0 to $21 million within three years. How the hell did he do that?</p><p class=\"text-body\"><span class=\"transcript-meta\">[13:26] João:</span><br>Chips in shoulders put chips in pockets,</p><p class=\"text-body\"><span class=\"transcript-meta\">[13:28] Alex James:</span><br>Right. The I mean, that shouldn't be possible, right, especially for like a services firm where the margins are meant to be really, really tight and like, that's insane growth. And it's not because of his niche, right? It's not because he said I do performance marketing for B2B SaaS. It's I do performance marketing for B2B SaaS, because the way that B2B SaaS companies acquire customers is fundamentally broken. The model is broken. Right now, all we're doing is trying to like put out ebooks, get people to fill out a form, then we're going to spam them with nurture email sequences, we're going to throw salespeople at them, and hopefully can, you know, convert enough of them to justify all of this cost. And if you bear out the data, he was like, yeah, look, this approach, It gets customers, but the conversion rate is 0.5%. And instead of doing this kind of like, capture like have a wide net and capture whoever comes in and then just hope for the best. What if we had a new model that focused on high intent leads only? Because when you do and you bear it out through the pipeline, it's not 0.5%, the conversion rate is 8%. This is what he championed. This was like a playbook that a new model that he was fighting for. This is how things are typically done. Here is how things should be done. And it was that perspective. That is what people actually bought into it. It wasn't the niche. It wasn't the positioning. It was the perspective. And he even said on a podcast at one point that he was regularly closing 40k a month contracts with one phone call, which tells you that the client didn't even really know what they were buying. They didn't know the details and the nitty gritty structure of the engagement.</p><p class=\"text-body\"><span class=\"transcript-meta\">[15:08] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[15:09] Alex James:</span><br>They just were so bought into the ideology, into the philosophy behind the approach that it became a no brainer. And so when I say your perspective is your product, I mean it literally. That is what people buying. That's what people are buying, your perspective.</p><p class=\"text-body\"><span class=\"transcript-meta\">[15:20] João:</span><br>Hmm. That's, those are some fascinating numbers. There's an aspect around this perspective or it's not so much the word contrarian. I don't like that word. I think it's a little bit cheap, but just, you know, seeing something that others are not paying attention to or just being a couple of pages ahead in the book, right? You're seeing the trends where things will be.</p><p class=\"text-body\"><span class=\"transcript-meta\">[15:31] Alex James:</span><br>Mm. Yeah. Yeah, just and just exactly on that I completely agree. I don't like the word contrarian, because it feels like you're just being different for the sake of different, which is edge lording and you're trying to have hot takes and whatever. You're here to serve, you're here to help, not just kind of be an edgy rock star kind of guy, right. And I think the thing that the question to answer isn't like, well, what's the common assumption? And then what's something that I could say that's opposite to that?</p><p class=\"text-body\"><span class=\"transcript-meta\">[15:51] João:</span><br>edge-boarding.</p><p class=\"text-body\"><span class=\"transcript-meta\">[16:09] Alex James:</span><br>It's what are my competitors not saying that my customers need to know?</p><p class=\"text-body\"><span class=\"transcript-meta\">[16:14] João:</span><br>And so one of the things I think about this the whole perspective thing is that despite being super powerful it requires a certain level of courage I think like to, to,to find it, to look for it, to find it and to claim it, right? So one of the things I've been intrigued by is as you help clients develop perspectives, right? Or I don't know if the verb is polish, chisel, model, I don't know what the motion is, but like this is something you help your clients do, right? And I assume it changes from client to client. But... I would imagine this to be very high context kind of process, You really need to be next to them and inside their head and them inside your head to arrive at this kind of nugget of... How do you do that?</p><p class=\"text-body\"><span class=\"transcript-meta\">[17:03] Alex James:</span><br>Absolutely, yeah, it's like I tell my clients, I work in collaboration, not isolation. This is not something that you can just fill out like a brief or some kind of questionnaire and then I'll crawl into my cave and type, type, type for a week and send it back and be like, what do you think? Like, it's just not how this works at all. Because even if, even if, and this is key, like even if what I sent back was...</p><p class=\"text-body\"><span class=\"transcript-meta\">[17:13] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[17:28] Alex James:</span><br>... perfect, because they weren't involved in the development of it, they're not going to be bought into it. Because like you can have the right perspective, but if you don't have the conviction behind it, especially in the thought leadership era where you need to be making content against that, then it will just it'll never take off, it'll never work. It those it's perspective and conviction of your perspective, they go hand in hand, that's what's really, really required to make this work.</p><p class=\"text-body\"><span class=\"transcript-meta\">[17:31] João:</span><br>Mm-hmm. I love that you've used the word conviction because I've also been thinking about it in those terms. People can get the AI to just generate perfect copy, right? Eventually it will get there for sure. But then just getting it really quickly, it's a way of your conviction to stay with it for months, years, and really claim that thing. So the process of you could get</p><p class=\"text-body\"><span class=\"transcript-meta\">[18:04] Alex James:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[18:18] João:</span><br>... some sort of an Alex bot that would be maybe 60 % as good. But then not doing the work together, would you trust that? Because you have like 30 tabs open and you're doing all these little things and suddenly you have like heart-shattering insight from one of the 40 tabs you have open. That won't feel like heart-shattering insight. It will just feel like, yeah, there's this thing that...</p><p class=\"text-body\"><span class=\"transcript-meta\">[18:23] Alex James:</span><br>Hmm. Exactly. And this is why like...</p><p class=\"text-body\"><span class=\"transcript-meta\">[18:41] João:</span><br>So yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[18:43] Alex James:</span><br>...When it comes to expertise...the classic like find a gap in the market and fill it. That works for commodities, it doesn't work for expertise. Because if you aren't radicalized by your own perspective, if you aren't permanently pissed off that your way isn't the way, then you will burn out before it ever catches on. Right? Like your perspective is your product, yes, but your conviction is the conduit.</p><p class=\"text-body\"><span class=\"transcript-meta\">[19:09] João:</span><br>So yeah, I'm on a good path then. I feel constantly pissed off that this is not commonly accepted. I feel so much more reassurance now.</p><p class=\"text-body\"><span class=\"transcript-meta\">[19:15] Alex James:</span><br>Great. Good. Yeah. Absolutely, you want to be able to like you should feel like and this is what I tell my clients like tell me how you really feel What's that thing of like you want to grab them by the shoulders and shake them and be like don't you see don't you see? That's the energy that we're trying to capture</p><p class=\"text-body\"><span class=\"transcript-meta\">[19:24] João:</span><br>Mm-hmm. Yeah, it makes sense. It makes sense. So now we have a little bit of the answer of how to craft the perspective. Just...</p><p class=\"text-body\"><span class=\"transcript-meta\">[19:38] Alex James:</span><br>So I mean, kind of like, it doesn't really, you know what, the process doesn't really change all that much. Because as long as you know what the inputs are, then you can get to the right output. Because the first step when I'm working with my clients is we need to isolate. actually don't wanna start with your customer, we wanna start with your context, the context of your category. A lot of people are like, okay, well, who are we selling to? What's our customer? Let's like create a fictional character about how old they are and how many kids they have. And if they drive to work or take the bus, that stuff doesn't really, it's not relevant because when it comes to like selling products and services, it's not about their situation. It's about their motivation. And so what we need to understand is, okay, A, what are the options that they have in the market, who would they go to if not us? And we want to think about like direct competitors and indirect competitors, so that we can isolate the differentiation. That's where we want to start because the differentiation is also the innovation. That's like the unique thing that is on offer here. And that's actually where we want to begin because that's also where we will find the perspective. And so</p><p class=\"text-body\"><span class=\"transcript-meta\">[20:46] João:</span><br>And that's a harder thing to copy as well, right?</p><p class=\"text-body\"><span class=\"transcript-meta\">[20:48] Alex James:</span><br>Completely, yeah, yeah. And actually let's circle back to that because I think a question that I often get is like, well, couldn't people just copy your perspective? And I think it's a misunderstanding of how this actually works and how this folds out. But the first thing we wanna understand is like, who are the other, where are the other pieces on the chess board? Starting with the customer is like playing chess blindfolded. You need to know where the other pieces are. So that you can position against them strategically. And so all we need to do is ask two really very simple questions, which is, what do you do that your competitors don't? And what don't you do that your competitors do? If we answer those two questions, we will get a short list of where you are actually differentiated. It's normally, like truly, it's one or two or three, maybe four things, maybe. But usually it's like two things that you truly do that is differentiated. I can give an example of a client that I worked with. It was an organic social media marketing agency. And they were kind of like, we do content creation for brands. Cool. And companies. Yeah, exactly.</p><p class=\"text-body\"><span class=\"transcript-meta\">[21:54] João:</span><br>companies...</p><p class=\"text-body\"><span class=\"transcript-meta\">[21:57] Alex James:</span><br>And so they didn't know, but they had a lot of opinions. They just didn't know how to like capture them or they didn't know which ones were useful or not. But by going through this and like figuring out like on a tangible level, on a values level, not on a vibes level, like what do you actually do when it comes to the delivery of your work that is differentiated? And they were like, well, what we actually do that's differentiated is that we don't just like go in there and like create a content calendar and then work with the juniors inside the company to like... Schedule it out, we run like strategic workshops with leadership teams and we focus on not just like putting out, you know, five posts a week so that we can tick the box, but like doing fewer posts, but making them of higher quality so that it actually gets the business results that they're after. Great. So that's what you do. And that goes into the second question of like after you've captured your differentiation,</p><p class=\"text-body\"><span class=\"transcript-meta\">[22:36] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[22:48] Alex James:</span><br>The question is simply, it's a very simple question. Why? Like, why do you do those things that your competitors don't? Why don't you do the things that your competitors do? That will actually be the skeleton key to your perspective, because that will give us a whole bucket of like opinions that we can go through and see which is most potent, which is the most powerful, what gets you fired up. Because then, go on. No, no.</p><p class=\"text-body\"><span class=\"transcript-meta\">[23:11] João:</span><br>And in that... sorry, go ahead. No, no, so I wanted to... Sometimes people... I've noticed this when, you know, working with clients. Sometimes people... They know on a broad level how they do what they do, but then they don't notice the decisions they make along the process. Like, you don't remember driving home every day, right? It's that kind of thing. So, it seemed to me nothing, so I guess you see this a lot, that people... They have a method but they don't realize they can't express it.</p><p class=\"text-body\"><span class=\"transcript-meta\">[23:35] Alex James:</span><br>Yeah, yeah, exactly. And I think that's a really good analogy of like driving home every day, but you don't remember the drive. When you've done it enough, you kind of forget what you do that's special about you and about what it is that you do.</p><p class=\"text-body\"><span class=\"transcript-meta\">[23:49] João:</span><br>And so I would guess maybe I'm assuming here, but you can correct me. So much of your work with these clients or at least a portion of it is to notice the little threads that they're not realizing that they left in terms like the insight into, wait, wait, that thing you just said, this tells me a lot of how you think. Are there things that you pay attention to like?</p><p class=\"text-body\"><span class=\"transcript-meta\">[24:07] Alex James:</span><br>Absolutely. Completely. mean, what I'm always looking for is this, it's almost always the throw away comments that end up being the really powerful things that we end up leading with. I remember there was one client that I worked with. This is a full service marketing agency. They didn't like marketing, branding. This is, okay, I'll give you like the direct quote on what the headline was on their website...</p><p class=\"text-body\"><span class=\"transcript-meta\">[24:17] João:</span><br>Mm-hmm. Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[24:33] Alex James:</span><br>...marketing, branding and public relations designed for your unique needs. So I would like struggle to create a more general headline if I tried. But going through the process, it was the public relations thing that really stuck out to me. Because like they were for context, they were like losing, they kind of started this full service marketing agency, they had like a team of 15 people or something. And they did it before they had any clients in the door. And so they were just bleeding cash all day every day. And so they kind of like called me up and said, hey, can you help? And I said, I will try. What they were doing differently was the public relations thing. I was like, you know what? Most full service marketing agencies, in fact, I haven't seen any full service marketing agency that offers public relations. You guys do.</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:14] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:17] Alex James:</span><br>What's the deal with that? And the co-founder, said, well, yeah, not only do we offer it, we do it better than most dedicated PR firms because they just tend to do the spray and pray press release thing. He's like, I've got true connections with journalists. I can get our clients published in relevant publications that their customers would actually be reading. And we can use that to like generate true buzz and attention. And I was like, great.</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:29] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:44] Alex James:</span><br>So that's actually what we need to be leading with is a PR and then we've got the full service marketing there to funnel the attention that is generated from the PR activities. Now it's like your true all in one shop and we're not changing anything about what you do, we're just reordering the order of operations. And that became this kind tip of the spear message and perspective of don't just generate buzz, capture it. Like we'll generate the buzz with the PR, we'll capture it with the full service marketing.</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:49] João:</span><br>Mm-hmm. Yeah. Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[26:11] Alex James:</span><br>And they went from losing money to 1.1 million within 12 months, which I won't take full credit for, but you know, it helps to like have like a really good message that you can like go out there and use to be a conversation starter. And that's really what we're trying to do. Just like with me with the guitar, we're just trying to start the conversation. That's what the point of this is. And so once we kind of have, you know, an understanding of what all the opinions are...</p><p class=\"text-body\"><span class=\"transcript-meta\">[26:27] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[26:38] Alex James:</span><br>...then we can layer it into the three P's of perspectives. There are three types of perspectives. And this is something that I'm not seeing people talk about, but it's really, really important. And you can kind of picture like a pyramid, the perspective pyramid, like a triangle in three segments at the top. You've got the principle. This is like the mindset shift that you need your market to undergo in order to see the value and what it is you do. Then you've got the playbook perspective, which is like, okay, here is the model that people are following. And here's like the model that they need to be, the new model that they need to adopt. And then you've got practice, which is like, here is like the tactic that you want your market to be taking on or executing against. And that could be like, hey, start a YouTube channel. Cool.</p><p class=\"text-body\"><span class=\"transcript-meta\">[27:10] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[27:25] Alex James:</span><br>Once we have all of your kind of, once we've extracted all of your opinions, we can then layer them into one of these three categories of perspective. And that'll give us a sense of, well, where's the potency? What's most powerful here? And it becomes very, very clear very, very quickly because, you know, not all insights and opinions sit at the same elevation. It's like a map of a mountain range. there's layers to it.</p><p class=\"text-body\"><span class=\"transcript-meta\">[27:37] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[27:48] Alex James:</span><br>And so for this social media marketing agency that I was working with, what became most important, and this was another throwaway comment, was the founder, said, he said, yeah, know, most social media marketing agencies just tend to... ...help their clients try and go viral and they chase trends and they just do whatever they can to like get as many views as possible and try and get like a big follower, follower count, like a big audience because hey, a big number looks impressive. But what that does is actually sabotages the brand and sabotages their social media because it brings in the wrong people. They come in for like the viral trend thing that you did, but they're not sticking around for the actuals...</p><p class=\"text-body\"><span class=\"transcript-meta\">[28:16] João:</span><br>Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[28:29] Alex James:</span><br>...substantive content that's related to who the brand is and what the brand does and what the brand sells. And so what they focus on is really like building out small, dense, high intent audiences, people who could actually become customers one day. He said, everyone who follows you should be a potential customer, not just a random scroller. Boom, that is a killer perspective that...</p><p class=\"text-body\"><span class=\"transcript-meta\">[28:44] João:</span><br>I'm convinced.</p><p class=\"text-body\"><span class=\"transcript-meta\">[28:52] Alex James:</span><br>is that the market needs to hear, right? And so that's a principal first perspective. And that also lends into the opposing force because every perspective has an opposite. And we need to know what you are fighting against, essentially, what's the opposite of that. And so we've got the three P's, principal, playbook, practice. And then we've got the three M's of the opposing forces. We've got myth, which is opposite principal. We've got...</p><p class=\"text-body\"><span class=\"transcript-meta\">[28:55] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[29:18] Alex James:</span><br>...playbook and the opposite of that is malfunction, like the broken model that people are following. And we've got practice and the opposite of that is like the misfire, like the things that people are just executing that they shouldn't be or executing incorrectly. And so the myth that they were fighting against was like bigger audience equals better audience. That's what they needed to fight against. And so then that became this really, really pointy sharp perspective...</p><p class=\"text-body\"><span class=\"transcript-meta\">[29:22] João:</span><br>Mm-hmm. Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[29:41] Alex James:</span><br>... that ended up just doing wonders for them as a brilliant conversation starter that got people to enroll in their ideology. And that became like the headline on their website, which was, don't count your followers, make your followers count. This is what we're talking about. This is the kind of sharp perspective that every service firm needs to be leading with, not just we do social media marketing for brands.</p><p class=\"text-body\"><span class=\"transcript-meta\">[29:53] João:</span><br>Mm-hmm. And companies. But OK, so we're getting close to the tail end on this. And it was really, really good to see you like describe the process in kind of generic terms in a way that I could see it being applied to my own company, to other companies. It was very useful. And in this whole...</p><p class=\"text-body\"><span class=\"transcript-meta\">[30:05] Alex James:</span><br>...and copy.</p><p class=\"text-body\"><span class=\"transcript-meta\">[30:22] João:</span><br>Developing a perspective working with clients. I would imagine that at times you get in through the door of no messaging strategy But other things come up like things related to I don't know operations even perhaps Talent management like guys. Maybe you don't need this function, you know as this happened to you this sort of thing</p><p class=\"text-body\"><span class=\"transcript-meta\">[30:38] Alex James:</span><br>What I found is that, I mean, this is actually related to that question I hear a lot, which is like, well, can't somebody just copy your perspective?</p><p class=\"text-body\"><span class=\"transcript-meta\">[30:50] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[30:51] Alex James:</span><br>And it's a misunderstanding of what a perspective is because a perspective isn't just something that you say, it's a belief system that you adopt. And that has implications on every single part of your business. And so like when it comes to don't count your followers, make your followers count, that's certainly applies to their thought leadership content, because it's insights about how to build small dense audiences, not big hollow ones. It applies to</p><p class=\"text-body\"><span class=\"transcript-meta\">[30:58] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[31:13] Alex James:</span><br>the kind of work that they do for their clients. They don't coordinate content calendars with juniors. do scheduling, like they do strategic workshops with the executive team. It goes to the contracts that they set out for their work as well. It's not like, hey, we're trying to post five times on Instagram every week. It's like, we're going to post one time every week, but we're going to make that, we're going to like channel all the resources that would have gone and spread across the five into one really high impact piece, because we know that that's where the leverage comes from. And it goes into like...</p><p class=\"text-body\"><span class=\"transcript-meta\">[31:26] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[31:41] Alex James:</span><br>... who they hire, how they onboard, it applies to everything. And when you have a perspective that you can get everybody internally excited by, that leads out externally across every single touch point, every single thing that you do and the way that your business model is structured in the first place. It's a really, people think of a perspective as like an item on a differentiation menu. It's not, it's the bedrock, it is a foundation, it's the lens...</p><p class=\"text-body\"><span class=\"transcript-meta\">[32:05] João:</span><br>Mm-hmm. Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[32:08] Alex James:</span><br>...that every decision is made through. Every single decision you're asking yourself once you've truly adopted a perspective, it's does this align with our perspective, yes or no? And that actually informs the decision making.</p><p class=\"text-body\"><span class=\"transcript-meta\">[32:19] João:</span><br>Bravo. Yeah, this was really good. I'm trying to, I might edit some bits of my jaw, my slack jaw at some point, but just trying to recap here. So we started this conversation from the way you came into this, like the history of you coming into this perspective on perspective and on niching not being... ...enough for today. And then eventually we started to explore a little bit of, okay, so if niching is not enough and you need a perspective and the perspective is such an inherent part of everything that you do, you've explained this, like how you do it, how you do the work actually, gave us some examples of the leverage and the potency, I like this word, of other companies that have...used a similar approach, really going really strong on having a differentiated perspective. And now we ended up touching on the inevitable aspect of if you shape perspective, you will eventually shape many other areas, all of the areas of the company. And it creates this environment where the company is impossible to copy because to copy the company, we need to copy like the entire thing that makes up the company, right?</p><p class=\"text-body\"><span class=\"transcript-meta\">[33:26] Alex James:</span><br>Yeah, yeah, exactly. Great, great recap. You nailed it. Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[33:30] João:</span><br>I'm very good at recaps, very good.</p><p class=\"text-body\"><span class=\"transcript-meta\">[33:57] João:</span><br>And so Alex, you've shared so much about like your work and your perspective and where can people find more things about this, about your work?</p><p class=\"text-body\"><span class=\"transcript-meta\">[34:12] Alex James:</span><br>Yeah, you can find me, my website is minimalistmarketing.co. That has information about, a bit more information about how I work and what I do and who I work with. And you can also find my online course called Message Matters Most through there as well. Otherwise, I post all of my big brain thoughts on LinkedIn. I don't post... ...very often, maybe once a week, but I make sure every post is something that I think is important for people to hear. So feel free to follow me there.</p><p class=\"text-body\"><span class=\"transcript-meta\">[34:43] João:</span><br>Yeah, there's a lot of good stuff there. Do you have a place for the small brain posts we can follow as well?</p><p class=\"text-body\"><span class=\"transcript-meta\">[34:49] Alex James:</span><br>I have a place from it's my it's my notes app where things go to die. Yeah</p><p class=\"text-body\"><span class=\"transcript-meta\">[34:52] João:</span><br>okay. I know how that is. Okay. So thank you so much, Alex, for being here and looking forward to talk to you again.</p><p class=\"text-body\"><span class=\"transcript-meta\">[35:02] Alex James:</span><br>Thanks.</p>"
}