{
  "id": "episode-2",
  "season": 1,
  "number": 2,
  "title": "Workshops as Worksites on the Digital World",
  "status": "To be released",
  "guest": {
    "name": "Spencer Ayres",
    "image": "assets/images/guest-pictures/SpencerA.png",
    "linkedin": "https://www.linkedin.com/in/spencerayres/",
    "website": "https://jointly.work/"
  },
  "summary": {
    "description": "Spencer and I got together to answer these questions and in the process went massively over the scheduled time. It's that good.",
    "guest": "<a href=\"https://www.linkedin.com/in/spencerayres/\"><b>Spencer Ayres</b></a> is an expert at running workshops that get results and a friend. After I saw the beautiful work he's been doing at Jointly.Work, I knew I had found a kindred mind."
  },
  "links": [
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/in/spencerayres/"
    },
    {
      "text": "Personal Site",
      "url": "https://spencerayres.com/"
    },
    {
      "text": "Workshop Templates",
      "url": "https://spencerayres.com/templates/"
    }
  ],
  "topics": [
    "What makes Workshops so good for productizing Expertise?",
    "What do the best workshops have in common?",
    "What's the future of Expertise work and how Facilitation fits into it?"
  ],
  "shortTopics": [
    "Workshop Productization",
    "Best Workshop Practices",
    "Future of Facilitation"
  ],
  "episodeLink": "S1E2_Spencer.html",
  "spotifyUrl": "https://open.spotify.com/embed/episode/YOUR_EPISODE_ID?utm_source=generator",
  "transcript": "<p class=\"text-body\"><span class=\"transcript-meta\">[00:12] João:</span><br>So hello everyone, welcome to Exotic Matter, which is the podcast where I will interview some internet friends and specialists around the topics of productizing expertise and also this new...frontier where knowledge work and expertise work finds itself, right? With AI, global competition, the whole niche down positioning kind of trend. And I'm really happy because today I'll be talking to Spencer Ayres, which was introduced to me by another person that has been on the podcast. you know, starting to look like a little bit of a clique. I would like to be part of this clique. And what excited me about Spencer and his work was, I think he has a nuanced take on both workshops as a tool that can be really useful and also workshops as a product for his own business, right? So, Spencer, welcome. Really happy to have you here.</p><p class=\"text-body\"><span class=\"transcript-meta\">[01:15] Spencer:</span><br>Thank you so much. Yeah, I'm thrilled to be here as well. All the conversations that we've had and our kind of internet friendship has been fantastic. And yeah, super excited to explore, you know, this whole world with you a little bit more as well. Super excited.</p><p class=\"text-body\"><span class=\"transcript-meta\">[01:31] João:</span><br>I think \"explore\" is really the right word. it feels that a lot of the thought on this is still coalescing, people are still figuring out what it means. And that's exactly the kind of conversations I would like to have. So I'm excited that you're open to exploration. Can you tell us a little bit more about what you do, what's your company, and so on?</p><p class=\"text-body\"><span class=\"transcript-meta\">[01:50] Spencer:</span><br>Yeah, it's always one of those questions which is I really want to have that like perfect 30 second explanation of exactly what I do. But it changes of course, depending on who you're talking to and who the audience is and whatever else. But essentially, you know, my main kind of reason for existence at the moment, I guess, is to help teams, individuals, businesses to improve.</p><p class=\"text-body\"><span class=\"transcript-meta\">[02:11] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[02:23] Spencer:</span><br>What it is that they're doing. And that's really broad, right? It's huge. There's a lot of different facets of what I do, but essentially it's coaching and consulting around improving your business. Often product and marketing is kind of the more niche area that I work in. It's not that niche. That's still a huge area, right? But it's always using kind of collaborative and creative techniques in order to bring out the best ideas, to make decisions...</p><p class=\"text-body\"><span class=\"transcript-meta\">[02:43] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[02:51] Spencer:</span><br>...with people. So I do a lot of and as well as workshops and I do have maybe a nuanced view of what facilitation and workshops is for me and that comes from a place of experience but it's all about trying to help people break through the noise, break through the difficulties, get unstuck with the kind of things that they're trying to do in order to get progress towards being a better business, having a better product, understanding customers better, all those good things that we often talk about around innovation. Sometimes I call myself an innovation coach and that's kind of the thing that I think resonates the best, but even that word innovation is kind of loaded with different contexts and different points of view about what that is. So I find it really a kind of a challenging one to get right. But yeah, that's probably like one of the worst explanations of what I do I can think of, hopefully you get it.</p><p class=\"text-body\"><span class=\"transcript-meta\">[03:46] João:</span><br>No, no, I get it, but also in the conversation we'll explore each aspect of that so people will get it too. But that's a very familiar feeling. I kind of felt that after voicing the question, I was like, oh, maybe this was an unfair question. But one of the things...</p><p class=\"text-body\"><span class=\"transcript-meta\">[04:03] Spencer:</span><br>No, at all. It's always... as you said, look, we're, we're, always exploring. And like, I think it's, I think that question, even though I get posed it so often and I have to introduce myself all the time, I'm still like, still, I think you and I and people like us, people in this world of facilitation and workshops and innovation, whatever else, we're always trying to push and pull on different levers to see the kind of things that resonate, right?</p><p class=\"text-body\">So I'm excited to talk about workshops and facilitation with you primarily today. yeah, like there's a whole load of things that, and here's another thing, right? Very quickly. The reason why it's so, one of the reasons this is so hard for us is because you can use these tools and these techniques for so many different areas of work, business, life, right? So it's, I find it really hard to kind of narrow down and say, do this thing, because I'm like, yeah, but like, workshop can be great for this and they can be great for that and they can be great for this. And so therefore it's really tough to say, you know, this is the area that I kind of work in. It's really, really challenging thing.</p><p class=\"text-body\"><span class=\"transcript-meta\">[05:12] João:</span><br>Yes, yes. And I mean, I think a lot of... So I feel strongly in the same way. And I feel that that breadth of application, a lot of it is related to many of these skills are really about how to work with others. So anything that you do with others can be improved by, you know, at least being aware of some dynamics, you know, not even talking to the level of knowing how to facilitate because that's useful, of course.</p><p class=\"text-body\">But I don't know, I can give you a personal example. When I've learned about the concept of the love languages, which is not related to workshops, right? I was like, ⁓ yeah, yeah, people relate to each other in different ways. This is very useful, you know? But it's not about workshops, but surely it helps as a way to connect with different participants and so on. So I share that feeling.</p><p class=\"text-body\"><span class=\"transcript-meta\">[06:09] Spencer:</span><br>Yeah, and I've got a similar story, a very quick one. I was with some friends for dinner a few weeks ago, and there was a moment, we'd all had a couple of drinks. It wasn't crazy, but just lubricated, the chat was flowing. And the two friends that were together, they were married couple, they just started to bicker at each other. Again, not having a big argument, they were just getting at each other. And I just came in with...</p><p class=\"text-body\"><span class=\"transcript-meta\">[06:31] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[06:37] Spencer:</span><br>...whatever it was that I said, I just said a few things and it just kind of every everyone's like anxiety, not anxiety, but everyone's like tension levels just dropped. Everyone suddenly went really at ease. Everyone was like, it's okay. We don't need to be going like that. We don't need to be bickering. don't need. And then the, friend's wife, she said, you should be a counselor. You should be like a marriage counselor. Like you just have this ability to just get everyone to be able to have a conversation at the right level. And I was like,</p><p class=\"text-body\"><span class=\"transcript-meta\">[06:45] João:</span><br>The tension</p><p class=\"text-body\"><span class=\"transcript-meta\">[07:06] Spencer:</span><br>...It's exactly what I do all the time, but just not for marriage and improving marriages is normally about improving businesses. And that starts, you're absolutely right. It starts with improving the teams, right? Get teams performing better together and you end up making some really, really amazing leaps in what your kind of organization can do. So yeah, it's funny. So it's such a similar world.</p><p class=\"text-body\"><span class=\"transcript-meta\">[07:27] João:</span><br>Yeah, it's crazy, it's crazy. I remember some time ago I was talking to someone that is also in a relationship where the other half is also kind of from this world and I was like, the dynamic at your home must be really amazing and the person was like jokingly, \"yeah, You know, we are just a normal couple.\" But from the outside, I was like, they must be excellent at solving every, detecting and addressing every kind of tension. But it's funny because my wife, she's not from this world, but eventually she started to get familiar with this stuff and applying it to her work and so on. And I think this relates a lot. I like the name of your company. This is jointly.work, right?</p><p class=\"text-body\">So it relates to that, again, getting people to work together and fix or solve things, figure out things.</p><p class=\"text-body\"><span class=\"transcript-meta\">[08:21] Spencer:</span><br>Yeah, for sure. Yeah. That was my business partner came up with that. He's, mean, he's... Johnny comes from a background of marketing strategy. So his job really, his, his mind works on these kind of plays of words, playing on words, getting people, getting organizations historically to an amazing positioning, sense of positioning, understanding the markets in order to kind of get to that very pithy sentence or the name that just kind of works and jointly is all about</p><p class=\"text-body\">Yeah, I mean, it's obvious when you kind of say, but it's about working together in the same direction rather than against each other. And often teams are working against each other without even knowing it. So we kind of think about this as a bit of a collaboration consultancy in many ways. And collaboration is at the heart of everything we do. Real proper collaboration, which is all about making progress on some of those difficult challenges. yeah, jointly.work is about working jointly.</p><p class=\"text-body\"><span class=\"transcript-meta\">[09:01] João:</span><br>Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[09:01] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[09:19] Spencer:</span><br>It's about getting teams aligned. And for us, it's these kind of three buckets of everything that we do come down to three areas, which is first, can we get the clarity that we need? So do we have clarity on the problem that we're trying to solve? kind of pushing and pulling with that problem as well often. Sometimes you think you're onto the right problem, but you need to push and pull at it to make sure that it's absolutely the right thing. You've got the right articulation.</p><p class=\"text-body\">The next thing is about alignment and making sure that everyone understands that problem themselves and has the same view of the problem as well. It's okay being clear, but unless everybody is clear, then that still will be confusing. And then the third thing is around creativity and confidence. So I guess actually there's three C's and an A. Perfect with the framework, but clarity, sorry...creative push to come up with interesting ideas rather than the obvious and then having the confidence in order to enact on and build on one of those ideas and push that forward. So it's a matter of kind of collaborative creativity, collaborative clarity and then confidence to be able to go and do the thing that you're kind of committing to as well.</p><p class=\"text-body\"><span class=\"transcript-meta\">[10:41] João:</span><br>I love that you've used the word confidence. A similar, familiar word that has popped up in other conversations was conviction. And they're not the same, but they are, you know, related enough for this observation, I think, which is the way a group arrives at the conclusion matters a lot to how much they trust that conclusion, especially when things get rough, right? Like change is difficult, people find objections and so on And I've been thinking a lot about this, especially with all AI can give you an answer, a very good answer very quickly. But I don't know about you. Sometimes I have like three different tabs on three different things. I'm asking perplexity and the answers are very good and very quick. then that speed affects, I think negatively the gravitas of the answer.</p><p class=\"text-body\">And you're like, yeah, this feels right, but am I going to do this or am I going to play with another question? And I'll just play with another question. And I feel that connects a lot with this way of working, collaborative with the people instead of at the people, right?</p><p class=\"text-body\"><span class=\"transcript-meta\">[11:34] Spencer:</span><br>Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[11:52] João:</span><br>Sorry, this was a little bit of a detour, but there's a very specific question I wanted to explore with you, which is this:</p><p class=\"text-body\">There are different companies and different specialists talking about collaboration, trying to create the conditions for collaboration. But I feel that oftentimes they cannot find ways of communicating the value of what they do in the same way that I think you guys have figured out. So specifically...</p><p class=\"text-body\">I look at your work and you've showed me also a little bit of behind the scenes and I see a lot of these, what I'll call workshop as a product. So it's not just about the facilitation, there's a package, there's an experience. Can you tell me more about how you guys started to shift in that direction of, know, wrapping things in?</p><p class=\"text-body\"><span class=\"transcript-meta\">[12:52] Spencer:</span><br>Yeah, yeah, thank you. Yeah, I appreciate that opportunity to talk about this because it's something that Johnny and I have kept relatively closed off for many years. We've worked with lots of clients with a, yeah, like a productized offer and haven't really shared it that widely. So now we're at this point that we really want to be able to share a lot of this stuff. And I think you're right that it comes down to many more layers...</p><p class=\"text-body\"><span class=\"transcript-meta\">[13:09] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[13:21] Spencer:</span><br>...than just facilitation alone. And actually I think we've got an interesting nuance on what we consider to be, or how we approach facilitation as well, which is different to lot of the way that a lot of other people seem to be talking about facilitation. But in terms of the package and how that emerged, Johnny and I have been working together, actually since about the same time that I was working with Nick, so Nick Himowicz who's been on your show as well, we've all known each other for about 10 years.</p><p class=\"text-body\">We worked with a company previously called Freeformers together and Johnny and I, he was on the marketing side, I was on the product side for this company. And we kind of came at a similar kind of set of challenges from different angles. Again, him from marketing strategy, me from product and innovation. And we always saw that facilitation and workshopping was an opportunity to bring people together, bring people together around.</p><p class=\"text-body\">to get a shared understanding of the world and to try to solve challenges in an interesting way. At that time, we did a workshop with Sky TV and it was all about crafting or coming up with a new proposition for kids TV. And it was at the time there were, know, mobile devices were out, kids starting to have mobile devices, iPads or whatever else. We're probably going back to...</p><p class=\"text-body\"><span class=\"transcript-meta\">[14:45] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[14:48] Spencer:</span><br>...sort of 2014, 15, something like that, about 10 years ago. And we turned it into like a three day workshop event. And I at that point had been facilitating and done running workshops, but I hadn't done any with this company because I was kind of at a slightly more senior level rather than the kind of directly facilitating. And for this workshop, it was good, but it started to go downhill and things weren't going so well. There were 20 people from the company and they were starting to get a little bit... edgy, they weren't quite enjoying things, they were kind of making, questioning some stuff. And I jumped in and ran this, this session kind of, yeah, just like spur of the moment jumped in and ran a session and it completely changed the whole dynamic of the rest of those three days. And suddenly everyone was energized again, suddenly we're back on track. And what came out of those three days was, two propositions that one of them launched within 12 months at Sky.</p><p class=\"text-body\">we'll kind of never get the credit for it. Even though this idea first emerged during these three days. Fast forward about a year and Sprint, the book by Jake Knapp and John Zaretsky came out and I was reading it and I showed it to Johnny and I showed it to Nick and everyone was kind of getting excited about this thing. And it dawned on us that this is basically what we did for this sky work, this proposition, three days of propositions. It was basically a design sprint.</p><p class=\"text-body\"><span class=\"transcript-meta\">[15:59] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[16:17] Spencer:</span><br>But what they had done, what Sprint had done, what John Zaretsky and Jake Knapp particularly did, is that they had codified this multi-day workshops into a standard approach in order to solve any problem very quickly. Or kind of, know, prototype and all that kind of thing very quickly. And it was the standardization that really kind of interested me because before that I had, I was building new workshops all the time for brand new things and never had that kind of productized feel... stuff and that was the kind of aha moment to go actually you could you can productize you can turn it into turn something into kind of an off-the-shelf thing that you can run with and then what we did over the next couple of years and Johnny did this particularly well was started to weave in these elements of storytelling of design of UX and all of these other disciplines that we've been working around for a long time started to weave them together into this whole package so every one of our</p><p class=\"text-body\">Miro experiences has a full story. It's had like this narrative arc that goes with it. It has a, yeah, and maybe I'll share some of these so can maybe put them on as B-roll or whatever as well. So our brand sprint is set in a gym and it's a, every one of these is a kind of cross-sectional building and the building opens up so you can see the rooms inside this, inside the building and</p><p class=\"text-body\"><span class=\"transcript-meta\">[17:22] João:</span><br>Yeah, I've seen the Miro's. It's really nice, for sure.</p><p class=\"text-body\"><span class=\"transcript-meta\">[17:45] Spencer:</span><br>In the gym, you've got gym equipment. So this is all about strengthening the brand, you know? So it's this storytelling arc of like, particularly brand people don't like you to reinvent things. They want something which is about building on what exists and strengthening things rather than bringing something new. So a lot of these little storytelling elements really help. We have things like an innovation lab, which is like a Silicon Valley tech campus with things like wind tunnels and robot arms and drones and all these other things to kind of symbolise experimentation and rapid prototyping and exploring, you know, new things and uncertainty and all these little signs and triggers and symbols that get people to think differently and show up differently. And we've packaged all of that. So we now have actually, I think we've got 12 different versions of these experiences from things like sustainability sprints...</p><p class=\"text-body\"><span class=\"transcript-meta\">[18:40] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[18:43] Spencer:</span><br>...strategy sprints, design sprints, innovation, growth, product marketing, messaging, those kind of things as well. it's all about having that consistency of experience. Everything does change because we iterate as well and we kind of build out new versions of things as we kind of find new things or realise that something didn't work quite so well. But we're taking the approach of, I guess, UX design and storytelling to workshops so that it becomes like a production rather than a you know rather than it just being a ⁓ yeah like a a fun exercise that kind of brings people together we want a whole experience to to get people to to really push people in different ways again get them to think differently as well</p><p class=\"text-body\"><span class=\"transcript-meta\">[19:17] João:</span><br>Mm-hmm.</p><p class=\"text-body\">Okay, so there's two segues from this that I'm really intrigued by. So the first one is, I think that on your website or perhaps your LinkedIn page, you say that you call these experiences, these Miro boards, work sites, right? I think I've seen that. So one of things that I was intrigued by that, and I like that, is the language aspect. Like, let's create a name for this and frame what these experiences, right? So that was...</p><p class=\"text-body\"><span class=\"transcript-meta\">[19:48] Spencer:</span><br>Yeah. Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[20:03] João:</span><br>immediately like, okay, it positions your word in a slightly different way, a unique way when compared to others, Is this Johnny's stuff? Because we've mentioned that he was the word man.</p><p class=\"text-body\"><span class=\"transcript-meta\">[20:11] Spencer:</span><br>Yeah.</p><p class=\"text-body\">Yeah.</p><p class=\"text-body\">Yeah. So Johnny came. So I'll talk about that one particularly Johnny came up with this idea this this this link really to to websites. So think back for anyone old enough. Think back to the late 1990s when the internet was the thing and it was burgeoning and everyone was excited about things. And the talk of the town then the talk of every...every marketing department was we need a website.</p><p class=\"text-body\"><span class=\"transcript-meta\">[20:48] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[20:49] Spencer:</span><br>And websites were these, obviously now, right? But there were these places that you go to that are built on top of the internet and everyone needed a website for it to be their kind of online digital brochure of the company. That's what it was back then, right? This kind of web 1.0, one to many kind of thing. And everyone needed a website but it was built on this platform of the internet. Now, when we were starting to think about...</p><p class=\"text-body\"><span class=\"transcript-meta\">[20:58] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[21:17] Spencer:</span><br>...collaboration, proper collaboration, we started to think about what we sometimes call the UX of work as well, which is, know, how can we design the world of work in such a way as to make people thrive, enable teams to thrive, thrive through uncertainty, thrive through getting clarity and confidence. And then it was this kind of like aha moment of actually, the internet enabled websites to happen...</p><p class=\"text-body\"><span class=\"transcript-meta\">[21:23] João:</span><br>Mm-hmm, mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[21:46] Spencer:</span><br>...Miro and these other whiteboard tools kind of enable worksites to happen and for us a worksite is where real work happens in the future. Now it's a big leap to go from what we do with workshops to the belief that we see in the future which is that every company has multiple worksites and those worksites don't necessarily need to look like what we're creating but they are they are digital...</p><p class=\"text-body\"><span class=\"transcript-meta\">[22:01] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[22:15] Spencer:</span><br>...experiences that enable work to get done rather than often the digital experiences where people think work gets done is actually where wasted time happens, where conversations that aren't important happen, where you go round in circles through endless notifications and team messages and slack notifications and stuff that no one really needs to know about, right? All that sort of stuff is happening and people think of that as collaboration. Well, that's not</p><p class=\"text-body\">That's not really pushing us forward. So these are the places where real work can get done in a remote setting from anywhere in the world. So that's how we view work sites.</p><p class=\"text-body\"><span class=\"transcript-meta\">[22:59] João:</span><br>Jesus so it's thank you for that explanation and also the contrast between the illusion of progress I just answered 300 slack messages today or maybe 20</p><p class=\"text-body\">Microsoft Teams because it's a different UX. But maybe no decisions were made, right? It's just slacking people and there's no progress. And I remember when I was working remotely for a company, it was really striking how little most people think about how they work, right?</p><p class=\"text-body\">It's like nobody teaches you how to use email, you just get an email account. But some people actually know how to use email and they write useful emails. And some people are just, they never really stop to think about that. And I think most people never do because they're interested in other things. But when you start to develop an interest in how collaboration works, how decisions get made, how people can work together, then you start seeing all these little failure modes of, you know... just make a bullet list of, know, itemized bullet list with numbered points that people can address individually. Now, this is a silly example. But it's crazy that in a sense, working together is something that we do our entire lives, but oftentimes we don't really think about the patterns, which is... So a common experience I've noticed is people having PTSD around group work in school.</p><p class=\"text-body\">They hate group work from their school days, right? Because the group work is never, nobody really explains how you should do the group work. And then eventually some dedicated geeky person ends up doing the whole thing.</p><p class=\"text-body\"><span class=\"transcript-meta\">[24:45] Spencer:</span><br>Yeah Yeah Yeah</p><p class=\"text-body\"><span class=\"transcript-meta\">[24:55] João:</span><br>There's another thing I wanted to touch on because twice now you've mentioned like you guys have a nuanced perspective on facilitation, a slightly different. Can you tell us a little bit more about what's the more common perspective and what's perhaps your own perspective on facilitation?</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:12] Spencer:</span><br>Yeah, absolutely.</p><p class=\"text-body\">So I see a lot of, and this isn't trying to put down anyone at all, right? To be super clear. I see a lot of conversation about facilitation, which highlights.</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:21] João:</span><br>Mm-hmm.</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:32] Spencer:</span><br>...things like just like fun and excitement and bringing people together regardless of what the problem is that they're trying to solve, right? It's about kind of high energy icebreakers and like, you know, these fun exercises to get people to move. And I'm like, To your point, right? These are the things that I...</p><p class=\"text-body\"><span class=\"transcript-meta\">[25:53] João:</span><br>Yeah, I can see that this is going to be a great conversation. Thank you so much for sharing all of this, Spencer. I think we've covered a lot of ground already and there's clearly much more to explore about your approach to workshops and collaboration.</p><p class=\"text-body\"><span class=\"transcript-meta\">[26:00] Spencer:</span><br>I could talk with you for many more hours about this and I'm sure we will, right? But for now, yeah, I agree. Yeah, this is good. Yeah.</p><p class=\"text-body\"><span class=\"transcript-meta\">[26:03] João:</span><br>For now. So thank you. Thank you so much for this and for sharing so openly about not just what you do, but why you do it and why the way you do it, the way you do it. And Spencer, so for people that want to know more about what you're doing, where can they find more of your stuff?</p><p class=\"text-body\"><span class=\"transcript-meta\">[26:15] Spencer:</span><br>Great thank you. For yeah thanks for the opportunity to talk I mean you know I knew this was gonna be fun and and you've given an amazing space for me to be able to talk about some things that have been on my mind for a long time actually but haven't kind of openly shared that that widely so it's been it's been amazing to be able to do that. LinkedIn is probably the easiest place to be able to connect with me just Spencer Ayres go search you should be able to find me fairly easily on there. I am I've got a bit of a call to action if that's okay. I'm gonna surprise maybe When we had talked about this, but maybe it's a call to action And this is that I I'm looking actively looking to have more and more conversations with people that have an interest in facilitation and in workshops because I think and to your point earlier about not going hard on this thing that I don't enjoy about facilitation not being like ... poo-pooing that not like playing that pushing and the reason I'm really one of the reasons I'm not doing that so much is because I think there's a really interesting gap as I'm saying it which is that people are interested in facilitation and maybe have come through a learning style you know they've come through more like team team fun things but then they're wanting to change their their facilitation game and their approach ... to be more about kind of strategic problem solving, getting into those complex problems and then covering some kind of direction for new, for organizations. And so I wanted to be talking to people that are maybe thinking about that side of things, or maybe they're just like getting into facilitation, they're seeing it as an interesting thing to be doing. Maybe their business that they're working in is kind of pushing them towards more facilitation. I do have a belief, I have a... I have a number of things that have kind of contradictory in my mind about the future of facilitation. Maybe that's what we'll pick up at another time. But I think that facilitation will become far more widespread because when you look at big facilitation stuff that we do, you can very easily see how you can apply this to more regular meetings, everyday life, you know? And so I want to be talking to people that are looking to kind of... build up their faciliti.. facilitation skillset and their approach to facilitation. So get in touch on LinkedIn. That was a really long call to action. Could have made it far quicker. Get in touch. I want to talk to people that are interested in learning more about facilitation. I don't have anything to sell right now, but I am starting to craft maybe some kind of coaching slash training product around the styles of facilitation that I really want to be working with and things that I do. So, there you go. Get in touch on LinkedIn.</p><p class=\"text-body\"><span class=\"transcript-meta\">[29:06] João:</span><br>Perfect. Get in touch, get in touch. And... I think this is really good because there's not a lot of people talking about that gap, right? I agree. I think there's an interval in between one thing and the other thing. And I think maybe because of the algorithm, you see advice or information concentrated around one of the extremes, it feels to me at least. So yeah, everybody talk to Spencer and thank you so much.</p><p class=\"text-body\"><span class=\"transcript-meta\">[29:34] Spencer:</span><br>Amazing. Thank you.</p><p class=\"text-body\"><span class=\"transcript-meta\">[29:34] João:</span><br>Until the next time, was really good to talk to you.</p><p class=\"text-body\"><span class=\"transcript-meta\">[29:37] Spencer:</span><br>Yes</p>"
} 