{
  "id": "episode-8",
  "season": 1,
  "number": 8,
  "title": "Productizing with Offers",
  "status": "To be released",
  "guest": {
    "name": "Jay Melone",
    "image": "assets/images/guest-pictures/JayM.png",
    "linkedin": "https://www.linkedin.com/in/jaymelone/",
    "website": "https://jaymelone.com/"
  },
  "summary": {
    "description": "Jay and I have somewhat similar careers. We ended up in similar but different places and this is a phenomenal episode for those of us that sometimes feel we are insisting on something that is not working.",
    "guest": "<a href=\"https://www.linkedin.com/in/jaymelone/\"><b>Jay Melone</b></a> helps Experts turn their Expertise into Offers. He's also a friend. We go to talking roughly an year ago. I had signed up for his newsletter, sent him a note and next thing you know we're trading music suggestions and sharing lessons learned."
  },
  "links": [
    {
      "text": "LinkedIn",
      "url": "https://www.linkedin.com/in/jaymelone/"
    },
    {
      "text": "Website",
      "url": "https://jaymelone.com/"
    },
    {
      "text": "Newsletter",
      "url": "https://jaymelone.com/newsletter/"
    }
  ],
  "topics": [
    "What's the difference between productizing services and creating actual products?",
    "How do you structure offers that clients can easily understand and buy?",
    "What are the key elements of a successful productized consulting offer?"
  ],
  "shortTopics": [
    "Services vs Products",
    "Clear Offer Structure",
    "Successful Elements"
  ],
  "episodeLink": null,
  "spotifyUrl": "https://open.spotify.com/embed/episode/4UK2AfEHON0qkYxxwILIvR/video?utm_source=generator",
  "transcript": "<p class=\"text-body\"> <span class=\"transcript-meta\">[00:13] João:</span><br> So hello everyone and welcome to Exotic Matter, which is my podcast season where I interview some internet friends and specialists around this new world of  consulting and expertise businesses. And for today, I have Jay Melone, which is someone I've been talking to for a long time. And I think the first time we spoke, we started to share like...  music recommendations or something like that. And anyway, it was always nice to have access to Jay's really open and transparent  way of looking at this stuff. But let me introduce Jay in a formal manner. So Jay helps you turn confusing, hard to sell expertise into offers that are much easier to understand  than win dream clients. And so Jay, did I get it right?</p><p class=\"text-body\"> <span class=\"transcript-meta\">[01:08] Jay Melone:</span><br> Yeah, more or less.  It's all about taking the expertise that we're trying to bring to our clients and packaging them in ways that is easy to understand and therefore easy to buy.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[01:08] João:</span><br> roughly. \"easy to understand, easy to buy\", right? These things, you cannot really separate them. And you have an interesting name for these offers that you help people develop. Can you tell us a little bit more?</p><p class=\"text-body\"> <span class=\"transcript-meta\">[01:33] Jay Melone:</span><br> Yeah, so not only is it about cleaning up and often repackaging the sort of core work that you do, but in the world that I operate, which is with a lot of B2B consultants and fractional executives, agencies, mostly what you're getting paid to do is this some form of expertise. And so when you're selling, delivering and selling expertise, There's a learning curve to it. There's an on ramp to it. There you need to educate people in your market and what it is and how it works and why it's important. And so as it gets more and more complicated and your expertise builds, then you tend to need smaller, simpler ways to get those tools and services and the things that you have in your clients hands. And so part of what I do with people is I break down their core signature work into smaller bite-sized bits, which I call wedge offers. And it's just meaning, I learned it from a friend of mine because he was helping me in my first business think about how I could take the really complicated, expensive, very long to procure services and break them down into smaller offers that would open the door, demonstrate my expertise. start to earn the trust of my clients so that they could then move forward with some of my more premium upgraded services. And it always stuck with me how he called it a wedge offer. And so that's what I call it today.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[03:04] João:</span><br> Yeah, I like these names that, you know, relate to physical things that people have handled in the past, because really not abstract, like you understand what the wedge is, what it serves, what's for, people get it. And so there's like three words that keep coming up in this conversation so far, and it's a short one at this moment. So it's funny that they pop up. So the first one is expertise, the other one is services, and the other one is offers, and these things relate to each other, right? Why do you think \"offers\" is such a different word from \"services\".</p><p class=\"text-body\"> <span class=\"transcript-meta\">[03:39] Jay Melone:</span><br> That's a good question. The relationship that I see them is, I'll tell you a story. When I started my business, my first business 15 years ago, May 2010, almost 15 years to the day, I took the work that I did as a full-time employee and I said, you know, well, I got fired a couple of times, so that helped. And I said, you know, I bet I can do this on my own and not, you know...</p><p class=\"text-body\"> <span class=\"transcript-meta\">[03:47] João:</span><br> I love stories.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[04:09] Jay Melone:</span><br> ...not build somebody else's dream, not work for the man, but all these things, right? And I imagine that I was such a good employee, like, pretend you didn't hear about the part of me getting fired. I was actually really good at what I did. I just was very stubborn as well, but I was good at my job. And I said, well, I'm gonna take what I do and I'll just do it directly. I'll sell it and do it directly. And so because... I had been promoted and I'd been celebrated and I won awards, doing the work I did as an engineer and then a product manager. I was like, how hard can it be? I'm gonna like open doors and because I'm great at the services that I deliver, then I'm gonna have a line out the door. And actually it didn't work at all that way. I spent pretty much the next 10 years chasing after people. And so that's the difference. It's like. You're the workshop guy. Like when someone is in a workshop with you, they're like, this is amazing. Like why aren't all of our meetings like this? And the hard thing is you know how good your work is and you know all the things that go into making a great workshop and making it really sing. And that is the curse of knowledge of like, know I need to do all these things and it has to work this way and these people have to be in the room and I need like this kind of sign off from the executive who's not gonna dip out every five minutes and disrupt the whole thing. And all of that, that curse of knowledge makes it really hard for you to simplify it in a way that people that aren't thinking about workshops day in and day out like you are, to understand it, to understand the relevance, the importance of it. And then see the value in buying your ability to deliver great workshops.  And so the difference between the service that you provide as workshops and the offer is that the offer is how you package it, it's how you position it, and it's how you price it. So it's really kind of like the offer is the wrapper around the service that the rest of the world outside of you and your brain, how they see it and understand it.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[05:57] João:</span><br> I like this distinction between the inner view and the outside view. And I can imagine the clients that you work with,  the story that you told, your own story, I think it probably rhymes with a of people's stories. You're very competent at your craft, and then you try to take it outside of that structure. And then you realize that other people don't understand the craft or how much you know about it and so on. There's a thing, an analogy I like. You remember DVDs, right? I don't know where they went, but I really liked getting a movie, renting a movie, and watching the director's track, commentary track. Because then they would tell you like, oh, here we are lighting this scene in this way because we want to emphasize this kind of mood. And you're like, oh. And then you learn about all the things, right? And I think for expertise businesses, We have this director track going on all the time. We think people see it or hear it, but they don't because we're not verbalizing it. So there's this concept of legibility around expertise that I really like. Can other people see how much you know and how valuable it is? And that's how I see the connection to the offer, which to my mind is expressed in language that even non-experts can understand.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[07:40] Jay Melone:</span><br> Yeah, exactly. Because if you try to teach them everything you know about your expertise, that's not really what they're paying you to learn everything for you. Some people are, and that's more of like a training business model. But for the ones that just want the value from what you do, they don't need the jargon, they don't need the process, they need to understand how's this gonna work, what we need from me, and is it gonna work for what I need it to do? That's where your offer comes in. And then like, do I feel like it's...</p><p class=\"text-body\"> <span class=\"transcript-meta\">[07:47] João:</span><br> Mm-hmm. Yes.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[08:10] Jay Melone:</span><br> \"Am I getting good value for my money?\" So in my world, what I try to tell people is we need to repackage your core offer and then develop wedge offers and both of them need to be so great. The value needs to be unmistakable that it's easy to say yes to or like to flip it on its head and to quote Alex Hormozi and offer so good that people feel stupid saying no to it. Yeah, exactly. That's as simple as it is.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[08:32] João:</span><br></p><p class=\"text-body\"> <span class=\"transcript-meta\">[points at bookcase] Right here, right here:</span><br></p><p class=\"text-body\"> <span class=\"transcript-meta\">[08:37] Jay Melone:</span><br> That's offer strategy. If that's what I do, offer strategy, I don't really use that, because strategy is a weird word, but offer strategy is so simple to describe because it's about clarity and focus and simplicity of how you do what you do and the results that you deliver. But actually like packaging that into a way that is clear and compelling is actually pretty challenging.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[09:02] João:</span><br> Yes, and thank you for that segue because just before this conversation, I was having another conversation with someone else at a different stage in your  process and expertise. But they were describing, I think something that I think is very common, I've struggled with it and I think you've seen it as well, which is... Knowing where to draw the boundaries. Like there's so much, know, there's so many ways is Like your expertise not exactly linear, right? But people in my in my perspective people sometimes struggle with knowing Where to put one thing in one box and which things go into the other box? Is this something you see in your network with clients?</p><p class=\"text-body\"> <span class=\"transcript-meta\">[09:50] Jay Melone:</span><br> I think what I see most is kind of what we've been circling around, which is they... They overcomplicate what they do. And then they make it worse by adding more words and more services. It's like, it's analogous to software development, right? You've got one feature that everyone loves to use and to make it better, quote unquote, you add this feature, this thing, this thing, then this other sister product that has a different login. And then it becomes like what we talk about as like a Frankenstein product.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[10:04] João:</span><br> Mm-hmm. Uh-huh. Yeah.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[10:30] Jay Melone:</span><br> And all people really wanted to do was an easy way to get to this one killer feature. That's like the story of Loom, right? They think they started as like a A-B testing software and they realized people were using the recording function over and over again and they just strip, they did the opposite. I love the story of Loom because that's how I think about offers. It's like strip all that other shit away that you think is important, like by adding more. People actually want less, they want less to think about. But it's scary because then,</p><p class=\"text-body\"> <span class=\"transcript-meta\">[10:36] João:</span><br> huh,</p><p class=\"text-body\"> <span class=\"transcript-meta\">[11:00] Jay Melone:</span><br> As you say no to the things on the fringes, it feels like you're saying no to opportunities and to money. But instead, you're just winning more of the right clients, you're doing more of the work that you want to be doing and have more time for higher value work and better clients.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[11:18] João:</span><br> Yeah, for sure. mean, I remember before I leaned harder into the whole workshop thing. And I think there's probably a bingo card of mistakes that people going out into the solo world commit. And I probably filled that bingo card pretty quickly. And one of them was like... João as a Service</p><p class=\"text-body\"> <span class=\"transcript-meta\">[11:44] João:</span><br> We started this conversation, I think even before like the episode, like talking about ways of describing what we do, right? And that's like a thing that you iterate on. You iterate on the description of what you do. And when I started, I had things like, I'm not proud of them now, but it's funny. Like, João as-a service what the fuck is that? You know, it's like so self-centered, so presumptuous, just pay me, you know? And I felt now with the... with benefit of hindsight, is that it seems that there's a pattern around people that really, like are really curious, they have like a big antenna, and they want to show the world like, look how many interesting things there's on my mind.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[12:32] Jay Melone:</span><br> Yeah, I hate to attack anyone craft, but lately the people that are, I have a background in product and software development and technology and design and UX and all that. like some of my crowd from the first stuff that I did and all the topics that I used to talk about have followed me into this new category of like sales and growth and offer strategy. But I have, Like these other people that have started to really resonate with what I talk about, especially brand people, because people that work in messaging and positioning and sales and marketing, there's so many overlaps with offers. And ironically, the people that work in brand are the ones that in my experience of doing this for a year and a half.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[13:10] João:</span><br> Mm.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[13:27] Jay Melone:</span><br> As crazy as it sounds, the people who work in brand who are supposed to be about like solid positioning and messaging, they're the ones when you go to their website, they've got 15 things listed. And I spoke with one last week and she was terrified to not have 15 bullets and to just have one or two because the story was that like she had been paid to do those things. And what I consistently tell people is your offer, Is not the only thing that you do. But to the world, it's where you start the conversation. So you bring people in the front door for the one thing that you wanna be known for. You do a great job doing that thing. And then you sell them on the other thing, the next thing, because now they're like, this has been great, what's next? So it's like, you're trying to sell the Lamborghini out of the gate because it'll mean less time marketing and selling, and then you can commit to them and you make all these excuses why. Selling the Lamborghini is best for them and best for you, but all they came to you for was like a new antenna for their car, right? And so like, antenna is probably like super outdated these days.  So yeah, anyway, it's like, them the, solve the problem that they came to you for and demonstrate the expertise. And then you can go into so many different avenues because now they're bought into working with you and the systems that you use and how you think.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[14:32] João:</span><br> Mm-hmm. Yeah, for sure, for sure. I think I also get a sense, I don't know if you feel this way. I'm intrigued. I want to know how you feel about this. There's a lot of people I think that, you know, became internet famous at a different time. The environment has changed. It's like there's everyone is online now. And it's not enough to have like a place where you list the things that you do because you're competing for attention, right? And I remember like, I wish I had started a blog like when I thought about starting a blog because back then you could be pretty generalist I think and still you'd get eyeballs. But now, because every interaction is mediated by some sort of algorithm and the algorithm doesn't know how to deal with general journalistic people, you kind of need to bet on something. This is my feeling. You kind of need to bet on something that is specific enough that the algorithm knows to show it for. right? And it's...it's uncomfortable. But yeah, I think there's the Internet has changed. That's my feeling.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[16:04] Jay Melone:</span><br> Yeah, someone, I'll tell you another story here. Someone this week mentioned me on a LinkedIn post and it was one of those posts where they like kind of acknowledge people that have helped them over the past year or something and there were a list of 10 people. I recognized a few so it was cool to be on that list. But the thing that I was most proud of was that next to my name was one word, offers. And I was like, man, I've been working to be associated with one word for 15 years now, because in my last, with my last company, was like product strategy and innovation and design thinking. It was like all these words came out of my mouth. And then when, like, it was hard enough for me to explain what I did, let alone having that second order effect where like somebody like yourself that appreciated the work that I did. But if someone came to and was like, We need a design sprint or we're working on our product roadmap or whatever the stuff that I used to do. Because I talked about five things, is that a one thing? Like was harder for you to remember me. Like I didn't stand out in your mind as much. And today it's like Jay's the guy that helps you with your offers. That's it. And I love that. I love the simplicity of it. Maybe because it's I'm starting a new business and I don't have, maybe in 10 years from now I'll feel differently and I'll want like, Offers and positioning and marketing and funnels and maybe I'll need a dose of my own medicine, but right now it feels so nice and calm and focused to just be the guy that works on offers.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[17:39] João:</span><br> It was great when you said that like I'm the workshop guy so I felt like the way you felt and it's the same thing as well like people that know me maybe you've felt this as well like people that know you from before sometimes they're like yeah but you do you do more things than that maybe you should be talking about the other things as well and it's really they mean well</p><p class=\"text-body\"> <span class=\"transcript-meta\">[17:59] Jay Melone:</span><br> Yep, and they mean well, they mean well. Like \"don't sell yourself short, you do so many other things\". That's fine, but like when it comes to my content, my positioning, what I talk about, my messaging, I just want it to be one thing so that everybody can remember me for that thing. And then behind the scenes, I'll sell them and work with them and do all sorts of stuff that I know I'm capable of doing, that I want to be doing. But on the surface, it's just one thing.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[18:25] João:</span><br> Okay, okay, I think this is a nice entry point into something else. When I talk to people about workshops, one of the questions they have is, so there's two kind of situations. Sometimes people, they want to create a workshop for something and they want like help on how to do it, but they know what will be the theme of the workshop, right? And some other times people are like, I think I want to workshop for this stage of the relationship, but I'm not sure what the theme is. And it's always very difficult because they tend to be experts that struggle with the things that you've described. And the way I tend to approach it is to look for past work that they have done that got outsized reactions from the clients. The clients really like that part, so focus on that. But I'm interested in how you help people select, because it's a big thing, like select a word. There's so many words, why one? Select a word for which to become more associated with. How do you approach this with your clients?</p><p class=\"text-body\"> <span class=\"transcript-meta\">[19:32] Jay Melone:</span><br> Yeah, good question. There is a relationship between words used and the offer itself. What? So I have a system.  The way that I'm, ultimately the problem I'm solving for business owners is selling more of their stuff and spending less time doing it. The more, the better that they can sell their services, the less time they spend on it, the more money they can make, the more they can work with better clients. So it's a sales problem, which is strange that like the guy that used to say that he hates selling is helping people with sales, but it's because I solved it in a way. that was different, that worked for me. So I took my product background and I fixed sales problems with a product-based approach and offer as a product. So I took all that background that I had in technology and product development and I used it to solve an adjacent problem in sales. And so I have a whole system that I take people through that I teach a big chunk of it in my free monthly masterclass.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[20:49] Jay Melone:</span><br> But it's a systems-based approach to start from the work that they want to be known for to like really claiming who their ideal client is and the problems that they solve for them. And then ultimately getting to the point where they've got clarity on their core, their signature offer, and then like developing wedge offers that will become more of like a revenue engine to help sell more and more of that thing.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[21:08] João:</span><br> Mm-hmm.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[21:10] Jay Melone:</span><br> So it's just like product. We work our way from this sort of top abstract level and drill and drill and drill and drill and clarify and clarify and shed and get really radically clear on the right offer for them to focus on. So it's more about that I've designed a system and a framework for how they can get themselves to the right offer. And then from what I do, as is I guide them through that system, but then I'm also poking at stuff. for example,  one of the offers that a lot of people love to talk with me about is like, I wanna build an assessment. I wanna create this great assessment and it's gonna point out all these things and then I'm gonna show them how they can fix it. And the challenge with that  is that when you're beginning the relationship, so a wedge is meant as a first engagement, a place to start the relationship. And when you start with an assessment, it's kind like you're pointing out the kinks in their armor, and you're still a stranger. So now you come in, you point out all the problems, which somebody's probably gonna feel bad about, or maybe even get fired over, and you're still a stranger. And the goal for you right now is to demonstrate your expertise, earn the trust of that relationship, show them how you can help them get the win that they're looking for.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[22:12] João:</span><br> Mm-hmm.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[22:31] Jay Melone:</span><br> So like what I'm doing is people are going through the system is I'm using all of my experience building my own offers and now building dozens of offers for other people to point out like, that's a good offer, but this, and this is a better offer. And most of the time the things are right under their nose. that's the most exciting but frustrating part is like, there's probably a thing that you do in your workshops that you could turn into a wedge that you just can't see because you've done it so many times. And then I come in and I look at it and we'd shape out all your whole ecosystem of offers. I'm like clear on who your ideal client is. And I'm like, it's this thing. You said that they love it. This is what works. It drives money. It's easy to do. You love doing it. And it naturally upsells this like big workshop program that you have here. This is it. And it's kind of like a, course that's what it is.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[23:23] João:</span><br> Yeah, which is, of course, the face... Actually, in my notes for this conversation, there's  bonus points for face palm moments because that's  exactly what makes people... It's kind of weird, right? Because in a sense, you feel a little bit dumb for not having seen that sooner, but at the same time, so powerful when someone reorients something that was already in your mind, but it just... It was placed in a way that you couldn't see it then then it make it like this. yeah for sure </p><p class=\"text-body\"> <span class=\"transcript-meta\">[23:55] Jay Melone:</span><br> Well, and what I remind everybody is, or share with everyone is when I'm working through offers, this is the thing I love most about what I'm doing right now. I loved my days at New Haircut and I liked being known for the product work I did. I never used anything that I brought into companies, that I taught, that I used, that I facilitated. I didn't use them. I didn't do problem framing. I didn't do run design sprints on my own ideas. Now, every time that I'm gonna run the master class once a month,</p><p class=\"text-body\"> <span class=\"transcript-meta\">[24:12] João:</span><br> Mm-hmm.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[24:24] Jay Melone:</span><br> when I'm working with clients and like going through the systems and the frameworks, I use it on my stuff like consistently because it's fast, it's easy, but it's also really helpful. I love the sort of like scratch your own itch ability to work through stuff like Right, and so like not only do I use the systems for myself and find gaps in my own thinking, but whenever I'm like, if there's like a big idea I'm working on, I hire someone who helps me think through my own offer strategy. Because it really is, it's like, hard to read the label from inside the jar, right?  So there's this woman that I hire every time and she comes in, she does exactly what I do for other people. She's like, Jay, it's right here. You're just, I don't know why you're over there. It's right here. And I'm like, of course. So.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[24:57] João:</span><br> Yes. I love that you share that. I love that you share that because like personally, sometimes I do feel that, you know, if I'm a workshop guy, need to to solve everything with workshops and I don't solve everything with workshops, right? And sometimes I think  as an expert that is known for a thing, you kind of assume that people will expect you to solve everything with your own tool yourself in your workshop. And then you realize that that's a good way of not shipping and just, you know, staying in the tinkering mode forever. One of the things that I think that's. It's is the undercurrent of this conversation is the whole dynamic of working with the clients, right? Because like the work the work that you do helping experts. You know. have  offers that are easy to say yes to and that are just a fraction of what they do but that they are a good fraction that will lead to more engagements. That aspect of working with them to figure out what we live in, what we take out and so on is by definition very, I've been using this expression, I like it a lot, shoulder to shoulder. You're both looking at the same thing. and working on the same thing. I don't think that it's as impactful to try to just teach people how you think around offers and let them do it. I mean, they'll get some out of it, something out of it, but they won't get the whole thing because there's a whole set of like weird decisions they didn't realize and like forks in the road they don't even notice. But in this dialectic conversation where you work with them, you go through this path, right?</p><p class=\"text-body\"> <span class=\"transcript-meta\">[26:55] Jay Melone:</span><br> Mm-hmm.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[27:09] João:</span><br> And I think my point around here is it feels that a lot of consulting is like that. It's like working with your clients, not for your clients. And like in this work that, this kind of work that we do that is somewhat similar in a sense, it's more obvious that. it needs to be participatory and so on. But I think there's other kinds of consulting that are waking up to this fact that,  I need to  solve problems with the client because it's impossible. just get all the context from my diagnosis. And to me, this ties into your product experience. I also have  some product background. And... it feels to me that the one thing that product taught me was how to create things in an environment of uncertainty, right? Because, you know, things keep changing and so on. And what you described to me, I think it connects to that. Like there is uncertainty about what people do, what people will be doing, what the market will want, what will the market pay for it and so on. So we need to have a more</p><p class=\"text-body\"> <span class=\"transcript-meta\">[28:02] Jay Melone:</span><br> you Mm-hmm.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[28:20] João:</span><br> hate to repeat the word, but iterative approach.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[28:24] Jay Melone:</span><br> Yeah. So can I share like a big aha moment I've had and it also is a face Paul moment as well. So when I started this business a year and a half ago,  also like product guy and seeing a problem that I was well equipped to solve my first attempt to solve it was a completely do it yourself,  product that I created. called it the productizer co-pilot. And I imagine that I could take my experience of developing offers and developing wedge offers and pour it into this thing that people could use on their own. And people would go through it and there are certain parts that they would get stuck and ask for help. And it was in still like a beta phase. And I would go in, I'd look at like some of their ideas that they had in there. I'd point things out. and I'd send them a Loom video and they'd be like, my God, that video was so helpful. I have so many ideas. There was such like an unlock and that happened over and over and over again.  And so I ultimately I realized was that I went from, back to your point, what I did is I went from this world where everything was done for my clients to trying to package it up into a completely do it yourself version because I got swept away in this idea of like,</p><p class=\"text-body\"> <span class=\"transcript-meta\">[29:45] João:</span><br> Mm-hmm. Mm-hmm.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[29:48] Jay Melone:</span><br> The allure of the creator economy and building courses and toolkits and things that were passive revenue. The first name of profit ladder was passive profits. And what I realized is it's the wrong order to do it in because you can have deep mastery in a thing that you do hand like shoulder to shoulder with your client. But the moment that you leave the room and you have to take all that expertise and bottle it up in a way that someone that has never tried this before. Or has a range of expertise, can do it successfully and feel really confident in their ability to take your systems and apply it to their business and their work. There's such a deeper level of mastery to do that. And I went from, do it all for them to do it yourself. And there was this massive drop off in their own effectiveness to take my systems and do it well. And so there's this done with you in the middle that everyone skips over.  And so like what I teach people is I have like sort of two sets of wedge offers that I teach people. The one that's like the where people go to first is the productized. That's like when you're creating courses and templates, it's completely do it yourself. It's like a digital evergreen thing that like the rags to riches overnight, get rich quick thing where you're sitting on a beach drinking Mai Tai as well. The money's rolling in all possible. And there's this middle ground.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[30:57] João:</span><br> Mm-hmm.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[31:14] Jay Melone:</span><br> where you take the work that you do that's complicated, hard to sell, and you just shrink it down. And I call those scoped offers. So you're still showing up and doing a thing. It's simpler. The results, you can deliver results faster. You get quick wins for your clients, but it's still seen as very valuable. And you're able to run multiples of those per month. So you don't need hundreds of thousands of people that creators do  in their business model. You still can work on a small set of clients. But now you're able to more easily sell those things. And so like the big aha moment for me was just that there's an order in which to shrink your offers down. And the big misconception and why online courses have such a bad rap is because everybody went from $100,000 high ticket done for you stuff to these $100 courses where they tried to package up all their stuff before they really had the expertise to do that well.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[32:09] João:</span><br> Yeah,That's such a good point, because if you try to package it before running it, and I think this applies to everything like courses, software, and so on, if you try to package it before you run it,  I think even unless you have like a specific psychological profile, you'll doubt yourself. Like the imposter syndrome will kick in. Because you're like, yeah, I have 30 hours of video because you can just pay people to record you talking about stuff. But do I trust that this thing is applicable in as many situations as I'm saying it is on the landing page? And then you start, you know, to... The insomnia comes in.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[32:55] Jay Melone:</span><br> And when you're selling $100 and $200 things, you need such a bigger audience to sell that to. What I'm not saying is wait to build your thing until you have the audience. What I'm saying is wait till you have the expertise to do it and the revenue that's stable from your signature and from some of those smaller scoped offers that you're doing. Now that sales is predictable and safe and feels like a good bet. Now that you've done all that work, you have the mastery, the expertise, now you can move into productized offers where you can start to use those offers to build your audience and to develop new revenue streams. Just don't jump to it too quickly because you're gonna bankrupt your company by chasing after $100 course sales with only like 400 people in your following.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[33:47] João:</span><br> Yeah, for sure, for sure. Distribution, right? Second time founders think about distribution.  Good, good. Okay, so I think this conversation could last longer, which I think is a good sign. But I have tried to stay within the time, otherwise maybe the audience will get distracted by our ramblings because we like to talk about this stuff,</p><p class=\"text-body\"> <span class=\"transcript-meta\">[34:12] Jay Melone:</span><br> Yeah.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[34:12] João:</span><br> And but let me just do a quick kind of recap on some of the things that that we've touched on. OK, so we touched on experts, they struggle with, you know, selecting parts of their expertise that are easier to understand, easier to say yes to. That's actually I think one of the first things they said on on this conversation, which was like people need to understand it and then they'll they'll buy it easy to understand, easy to buy, easy to say yes to. So we started from there, then we touched on some of the common  either misconceptions or mistakes that people have around productizing. You've shared even some of your personal stories around moving from one extreme to the other extreme and finding balance in between. And across this entire thing, there was this concept of the offer, which an offer is different from the service, the thing that you do, right? It's a wrapper. I think it's a word that is becoming much more present in the collective consciousness. I don't know, maybe it's just me, but it feels that more people are talking in those terms, which I think is a clever way of thinking about expertise. And we've also, you've shared also some stories about your background coming from product, using that product thinking into  packaging expertise, the wedge offers, tuning in this stuff and so on. And now towards the end, we touched on working with clients, which makes sense for the kind of thing that we do, but also for other kinds of things. And finally, this... this kind of cautionary tale of do the thing a few times before you jump into productizing it you need to have the expertise to productize otherwise it's not as solid. Would you like to add something? Did I get something right and wrong from this recap?</p><p class=\"text-body\"> <span class=\"transcript-meta\">[36:15] Jay Melone:</span><br> the expertise and the revenue to support like pouring into a productized offer. Yeah.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[36:21] João:</span><br> Okay, perfect, perfect. So first you accumulate expertise and you build the systems that give you this predictability and then you move into that. Perfect, perfect.  Jay, thank you so much for this. This was another conversation that we had that I really liked, but this one people are seeing. We've had others. And where can people find more about you, more about your work?</p><p class=\"text-body\"> <span class=\"transcript-meta\">[36:30] Jay Melone:</span><br> Exactly. Profitladder.net and I'm on LinkedIn a whole bunch as well.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[36:48] João:</span><br> Mm-hmm. You said something about the masterclass?</p><p class=\"text-body\"> <span class=\"transcript-meta\">[36:54] Jay Melone:</span><br> Yeah, I run a monthly masterclass. called the Offer Development Masterclass. Currently the format is one day, it's five hours, and I take you through a big chunk of my systems. And so you get real clarity on your signature offer, the work you want to be known for, and at the end of it, you leave with some real potential wedge offers that you could build into your business too. What I like to say is to become almost like a revenue engine.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[37:19] João:</span><br> Mm-hmm. Mm-hmm. I love the idea of a revenue engine. </p><p class=\"text-body\"> <span class=\"transcript-meta\">[37:23] Jay Melone:</span><br> Yeah, it's free.  There's a small application process because I'm really, I really want to make sure that the right people are there, not only for the rest of the group, but that you're at the right stage of your business, that it makes sense for you to start working on this stuff.</p><p class=\"text-body\"> <span class=\"transcript-meta\">[37:36] João:</span><br> I like that. I like that idea of qualifying not just on one dimension but on several. So that's good to know. So if people can join in, mean, they're doing something good. I think that's it, Jay. So thank you for this.</p>"
}